Autodesk.Revit.DB.SheetDuplicateOption
Options for duplicating sheets
Since:
2023
Since:
2023

Autodesk.Revit.DB.SheetDuplicateOption.DuplicateSheetWithViewsAsDependent
Duplicate the sheet. Copy its title block, details, viewports, and duplicate its contained views as dependent.
The newly created sheet will reference the newly duplicated dependent views.

Autodesk.Revit.DB.SheetDuplicateOption.DuplicateSheetWithViewsAndDetailing
Duplicate the sheet. Copy its title block, details, viewports, and duplicate its contained views with detailing.
The newly created sheet will reference the newly duplicated views.

Autodesk.Revit.DB.SheetDuplicateOption.DuplicateSheetWithViewsOnly
Duplicate the sheet. Copy its title block, details, viewports and contained views.
The newly created sheet will reference the newly duplicated views.

Autodesk.Revit.DB.SheetDuplicateOption.DuplicateSheetWithDetailing
Duplicate the sheet, copy the title block and details.

Autodesk.Revit.DB.SheetDuplicateOption.DuplicateEmptySheet
Duplicate the sheet, only copy its title block.